#include <stdio.h>
#include <locale.h>

int main()
{
	setlocale(LC_CTYPE, "RUS");
	zad1();
	zad2();
	zad3();
}
	
int zad1()
{
    printf("123\n"); // подзадание 1
	printf("1\n2\n3\n"); // подзадание 2
	printf("1\n \t2\n \t\t3\n "); // подзадание 3
	printf("%d\n %2d\n %4d\n %6d\n", 1, 2, 3, 4); // подзадание 4
	printf("%10.3f\n ", 12.234657); // подзадание 5
	printf("%10.5f\n ", 12.234657); // подзадание 6
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2); // подзадание 7
	printf("Деление %d на %d равно %d\n ", 7, 5, 7 / 5); // подзадание 8
	printf("Умножение %d на %d равно %d\n ", 2000, 4, 2000 * 4); // подзадание 9
	printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); // подзадание 10
	printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000); // подзадание 10
	printf("%f разделить %f равно %f\n ", 5., 2000000., 5. / 2000000); // подзадание 10
	printf("%g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000); // подзадание 10
	printf("%e разделить %e равно %e\n ", 5., 2000000., 5. / 2000000); // подзадание 10
	return 0;
}

int zad2()
{
	int N, K;
	N = 16;
	K = 30;
	printf("Сейчас %d часов %d минут 00 секунд\n", N, K);
	printf("Идет %d минута суток\n", ((N * 60) + K));
	printf("До полуночи осталось %d часов и %d минут\n", 24 - N, 60 - K);
	printf("С 8.00 прошло %d секунд\n", (((N - 8) * 3600) + (K * 60)));
	printf("Текущий час  = %.2f суток  и текущая минута =  %.2f часа\n", (N / 24.), (K / 60.));
	return 0;
}

int zad3()
{
	int L = 331, n = 2, k = 3, m = 3;
	printf("Дано: \n %.0f\n %.0f\n --------- \n Ответ:\n %+0*.*f", n, L, k + m + 2, m, (n / L));
	return 0;
}